using System;
using System.Collections.Generic;
using System.Text;

namespace Sabatex.ObjectExchange.Core;
/// <summary>
/// Абстрактий класс для аналізаторів, який надає базову реалізацію для збору та управління повідомленнями про помилки під час процесу аналізу. Цей клас містить список для зберігання повідомлень про помилки, а також властивості для отримання конкатенованого рядка повідомлень про помилки та індикатора успішності аналізу. Метод Error дозволяє додавати повідомлення про помилки до списку та повертає false для позначення виникнення помилки.
/// </summary>
public abstract class Analizer
{
    /// <summary>
    /// Список для зберігання повідомлень про помилки, які виникли під час процесу аналізу. Цей список використовується для збору та управління повідомленнями про помилки, що дозволяє централізовано зберігати інформацію про помилки та забезпечує зручний спосіб отримання конкатенованого рядка повідомлень про помилки через властивість ErrorMessage.
    /// </summary>
    private List<string> ErrorMessages = new List<string>();
    /// <summary>
    /// Отримує конкатенований рядок повідомлень про помилки, зібраних під час процесу аналізу. Ця властивість об'єднує всі повідомлення про помилки, що зберігаються в списку ErrorMessages, у один рядок, розділений символами нового рядка. Це дозволяє легко отримати всі повідомлення про помилки в одному рядку для подальшої обробки або відображення користувачу.
    /// </summary>
    public string ErrorMessage => string.Join(Environment.NewLine, ErrorMessages);
    /// <summary>
    /// Отримує значення, що вказує на успішність аналізу. Ця властивість повертає true, якщо під час аналізу не було зібрано жодного повідомлення про помилку; в іншому випадку повертає false.
    /// </summary>
    public bool Success => ErrorMessages.Count == 0;
    /// <summary>
    /// Додає повідомлення про помилку до списку ErrorMessages та повертає передане значення. Цей метод використовується для позначення виникнення помилки під час процесу аналізу, дозволяючи збирати повідомлення про помилки та повертати відповідне значення для подальшої обробки. Використання цього методу допомагає централізувати управління помилками та забезпечує зручний спосіб додавання повідомлень про помилки до аналізатора.
    /// </summary>
    /// <typeparam name="T">Тип значення, яке буде повернуто після додавання повідомлення про помилку.</typeparam>
    /// <param name="message">Повідомлення про помилку, яке буде додано до списку ErrorMessages.</param>
    /// <param name="value">Значення, яке буде повернуто після додавання повідомлення про помилку.</param>
    /// <returns>Повертає передане значення після додавання повідомлення про помилку.</returns>
    protected T Error<T>(string message, T value)
    {
        ErrorMessages.Add(message);
        return value;
    }
    /// <summary>
    /// Додає повідомлення про помилку до списку ErrorMessages. Цей метод використовується для позначення виникнення помилки під час процесу аналізу, дозволяючи збирати повідомлення про помилки без необхідності повертати значення. Використання цього методу допомагає централізувати управління помилками та забезпечує зручний спосіб додавання повідомлень про помилки до аналізатора.
    /// </summary>
    /// <param name="message">Повідомлення про помилку, яке буде додано до списку ErrorMessages.</param>
    protected void Error(string message)
    {
        ErrorMessages.Add(message);
    }
    /// <summary>
    /// Віртуальний метод для виконання процесу аналізу. Цей метод може бути перевизначений у похідних класах для реалізації конкретної логіки аналізу. За замовчуванням, цей метод повертає true, що вказує на успішність аналізу. Похідні класи можуть використовувати цей метод для виконання необхідних перевірок та збору повідомлень про помилки, використовуючи метод Error для позначення виникнення помилок під час аналізу.
    /// </summary>
    /// <returns>Повертає значення, що вказує на успішність аналізу.</returns>
    public abstract Task AnalyzeAsync();

}
