namespace Sabatex.Core;

/// <summary>
/// Базовий інтерфейс для сутностей з ключем.
/// </summary>
public interface IEntityBase<TKey>// : IEntityBase
{
    /// <summary>
    /// Первинний ключ  (int,long,Guid,string)
    /// </summary>
    TKey Id { get; set; }

    /// <summary>
    /// Повертає рядкове представлення ідентифікатора ключа об'єкта.
    /// </summary>
    /// <returns>Рядок, що представляє ідентифікатор ключа. Повертає порожній рядок, якщо ідентифікатор дорівнює     null.</returns>
    string ToKeyString()
    {
        return Id?.ToString() ?? "";
    }
}

/// <summary>
/// Представляє сутність, яка використовує рядок як свій унікальний ідентифікатор.
/// </summary>
public interface IEntityWithStringKey : IEntityBase<string> { }
/// <summary>
/// Представляє сутність, яка використовує ціле число як свій унікальний ідентифікатор.
/// </summary>
/// <remarks>Реалізуйте цей інтерфейс, щоб вказати, що сутність використовує ціле число як свій первинний ключ. Це зазвичай
/// використовується для сутностей, які потребують унікальної ідентифікації в системах або базах даних.</remarks>
public interface IEntityWithIntKey : IEntityBase<int> { }
/// <summary>
/// Представляє сутність, яка використовує 64-бітне ціле число як свій унікальний ідентифікатор.
/// </summary>
/// <remarks>Реалізуйте цей інтерфейс, щоб вказати, що сутність використовує 64-бітне ціле число як свій первинний ключ. Це зазвичай
/// використовується для сутностей, які потребують унікальної ідентифікації в системах або базах даних, де потрібен великий діапазон чисел.</remarks>
public interface IEntityWithLongKey : IEntityBase<long> { }
/// <summary>
/// Представляє сутність, яка використовує глобально унікальний ідентифікатор (GUID) як свій ключ.
/// </summary>
/// <remarks>Реалізуйте цей інтерфейс, щоб вказати, що сутність використовує GUID як свій первинний ключ. Це зазвичай
/// використовується для сутностей, які потребують унікальної ідентифікації в розподілених системах або базах даних.</remarks>
public interface IEntityWithGuidKey : IEntityBase<Guid> { }