using Sabatex.Core;
using System;
using System.Collections.Generic;
using System.Text;

namespace Sabatex.Models;

/// <summary>
/// Представляє організацію з її основними атрибутами, такими як коротка назва, повна юридична назва, МФО та ЄДРПОУ.
/// </summary>
public class Organization : EntityBaseVersioned<Guid>
{
    /// <summary>
    /// Коротка назва для відображення в інтерфейсі користувача (UI).
    /// </summary>
    public string Name { get; set; } = default!;
    /// <summary>
    /// Повна юридична назва організації, яка використовується в офіційних документах та контрактах.
    /// </summary>
    public string FullName { get; set; }= default!;
    /// <summary>
    /// МФО (Міжнародний фінансовий організаційний код) банку, в якому організація має рахунок. Використовується для ідентифікації банку при проведенні фінансових операцій.
    /// </summary>
    public string? MFO { get; set; }
    /// <summary>
    /// ЄДРПОУ (Єдиний державний реєстр підприємств та організацій України) організації. Використовується для ідентифікації організації в державних та фінансових системах.
    /// </summary>
    public string EDRPOU { get; set; } = default!;
    /// <summary>
    /// Отримує або задає адресу організації, яка включає інформацію про місцезнаходження, таку як вулиця, місто, поштовий індекс та країна.
    /// </summary>
    public Address? Address { get; set; }
    /// <summary>
    /// Отримує або задає унікальний ідентифікатор (GUID) адреси, пов'язаної з організацією. Цей ідентифікатор використовується для зв'язку з об'єктом Address у базі даних.
    /// </summary>
    public Guid AddressId { get; set; }

    /// <summary>
    /// Отримує або задає значення, що вказує, чи організація використовує спрощену систему оподаткування. Якщо значення true, організація підпадає під спрощену систему оподаткування; якщо false, вона підпадає під загальну систему оподаткування.
    /// </summary>
    public bool SimpleTax { get; set; }
}
